burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_i2c.c
/*!
    \file    gd32m53x_i2c.c
    \brief   I2C driver

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32m53x_i2c.h"

/* I2C register bit mask */
#define I2C_ADDRESS_MASK              ((uint32_t)0x000003FFU)               /*!< I2C address mask */
#define I2C_INT_EN_MASK               ((uint32_t)0x000000FEU)               /*!< I2C interrupt enable mask */

/* I2C register bit offset */
#define CTL0_DNF_OFFSET               ((uint32_t)0x00000008U)               /*!< bit offset of DNF in I2C_CTL0 */
#define CTL1_BYTENUM_OFFSET           ((uint32_t)0x00000010U)               /*!< bit offset of BYTENUM in I2C_CTL1 */
#define STAT_READDR_OFFSET            ((uint32_t)0x00000011U)               /*!< bit offset of READDR in I2C_STAT */
#define TIMING_SCLL_OFFSET            ((uint32_t)0x00000000U)               /*!< bit offset of SCLL in I2C_TIMING */
#define TIMING_SCLH_OFFSET            ((uint32_t)0x00000008U)               /*!< bit offset of SCLH in I2C_TIMING */
#define TIMING_SDADELY_OFFSET         ((uint32_t)0x00000010U)               /*!< bit offset of SDADELY in I2C_TIMING */
#define TIMING_SCLDELY_OFFSET         ((uint32_t)0x00000014U)               /*!< bit offset of SCLDELY in I2C_TIMING */
#define TIMING_PSC_OFFSET             ((uint32_t)0x0000001CU)               /*!< bit offset of PSC in I2C_TIMING */
#define SADDR1_ADDMSK_OFFSET          ((uint32_t)0x00000008U)               /*!< bit offset of ADDMSK in I2C_SADDR1 */
#define TIMEOUT_BUSTOB_OFFSET         ((uint32_t)0x00000010U)               /*!< bit offset of BUSTOB in I2C_TIMEOUT */
#define CTL2_ADDM_OFFSET              ((uint32_t)0x00000009U)               /*!< bit offset of ADDM in I2C_CTL2 */

/*!
    \brief      reset I2C (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_deinit(void)
{
    /* reset I2C */
    rcu_periph_reset_enable(RCU_I2CRST);
    rcu_periph_reset_disable(RCU_I2CRST);
}

/*!
    \brief      configure the timing parameters (API_ID(0x0002U))
    \param[in]  psc: 0-0x0000000F, timing prescaler
    \param[in]  scl_dely: 0-0x0000000F, data setup time
    \param[in]  sda_dely: 0-0x0000000F, data hold time
    \param[out] none
    \retval     none
*/
void i2c_timing_config(uint32_t psc, uint32_t scl_dely, uint32_t sda_dely)
{
    /* clear PSC, SCLDELY, SDADELY bits in I2C_TIMING register */
    I2C_TIMING &= ~I2C_TIMING_PSC;
    I2C_TIMING &= ~I2C_TIMING_SCLDELY;
    I2C_TIMING &= ~I2C_TIMING_SDADELY;
    /* mask PSC, SCLDELY, SDADELY bits in I2C_TIMING register */
    psc = (uint32_t)(psc << TIMING_PSC_OFFSET) & I2C_TIMING_PSC;
    scl_dely = (uint32_t)(scl_dely << TIMING_SCLDELY_OFFSET) & I2C_TIMING_SCLDELY;
    sda_dely = (uint32_t)(sda_dely << TIMING_SDADELY_OFFSET) & I2C_TIMING_SDADELY;
    /* write PSC, SCLDELY, SDADELY bits in I2C_TIMING register */
    I2C_TIMING |= (psc | scl_dely | sda_dely);
}

/*!
    \brief      configure digital noise filter (API_ID(0x0003U))
    \param[in]  filter_length: the length of filter spikes
                only one parameter can be selected which is shown as below:
      \arg        FILTER_DISABLE: digital filter is disabled
      \arg        FILTER_LENGTH_1: digital filter is enabled and filter spikes with a length of up to 1 tI2CCLK
      \arg        FILTER_LENGTH_2: digital filter is enabled and filter spikes with a length of up to 2 tI2CCLK
      \arg        FILTER_LENGTH_3: digital filter is enabled and filter spikes with a length of up to 3 tI2CCLK
      \arg        FILTER_LENGTH_4: digital filter is enabled and filter spikes with a length of up to 4 tI2CCLK
      \arg        FILTER_LENGTH_5: digital filter is enabled and filter spikes with a length of up to 5 tI2CCLK
      \arg        FILTER_LENGTH_6: digital filter is enabled and filter spikes with a length of up to 6 tI2CCLK
      \arg        FILTER_LENGTH_7: digital filter is enabled and filter spikes with a length of up to 7 tI2CCLK
      \arg        FILTER_LENGTH_8: digital filter is enabled and filter spikes with a length of up to 8 tI2CCLK
      \arg        FILTER_LENGTH_9: digital filter is enabled and filter spikes with a length of up to 9 tI2CCLK
      \arg        FILTER_LENGTH_10: digital filter is enabled and filter spikes with a length of up to 10 tI2CCLK
      \arg        FILTER_LENGTH_11: digital filter is enabled and filter spikes with a length of up to 11 tI2CCLK
      \arg        FILTER_LENGTH_12: digital filter is enabled and filter spikes with a length of up to 12 tI2CCLK
      \arg        FILTER_LENGTH_13: digital filter is enabled and filter spikes with a length of up to 13 tI2CCLK
      \arg        FILTER_LENGTH_14: digital filter is enabled and filter spikes with a length of up to 14 tI2CCLK
      \arg        FILTER_LENGTH_15: digital filter is enabled and filter spikes with a length of up to 15 tI2CCLK
    \param[out] none
    \retval     none
*/
void i2c_digital_noise_filter_config(uint32_t filter_length)
{
    /* clear DNF bits in I2C_CTL0 register */
    I2C_CTL0 &= ~I2C_CTL0_DNF;
    /* mask DNF bits in I2C_CTL0 register */
    filter_length = (uint32_t)(filter_length << CTL0_DNF_OFFSET) & I2C_CTL0_DNF;
    /* write DNF bits in I2C_CTL0 register */
    I2C_CTL0 |= filter_length;
}

/*!
    \brief      configure the SCL high and low period of clock in master mode (API_ID(0x0004U))
    \param[in]  sclh: 0-0x000000FF, SCL high period
    \param[in]  scll: 0-0x000000FF, SCL low period
    \param[out] none
    \retval     none
*/
void i2c_master_clock_config(uint32_t sclh, uint32_t scll)
{
    /* clear SCLH, SCLL bits in I2C_TIMING register */
    I2C_TIMING &= ~I2C_TIMING_SCLH;
    I2C_TIMING &= ~I2C_TIMING_SCLL;
    /* mask SCLH, SCLL bits in I2C_TIMING register */
    sclh = (uint32_t)(sclh << TIMING_SCLH_OFFSET) & I2C_TIMING_SCLH;
    scll = (uint32_t)(scll << TIMING_SCLL_OFFSET) & I2C_TIMING_SCLL;
    /* write SCLH, SCLL bits in I2C_TIMING register */
    I2C_TIMING |= (sclh | scll);
}

/*!
    \brief      configure I2C slave address and transfer direction in master mode (API_ID(0x0005U))
    \param[in]  address: 0-0x3FF except reserved address, I2C slave address to be sent
    \param[in]  trans_direction: I2C transfer direction in master mode
                only one parameter can be selected which is shown as below:
      \arg        I2C_MASTER_TRANSMIT: master transmit
      \arg        I2C_MASTER_RECEIVE: master receive
    \param[out] none
    \retval     none
*/
void i2c_master_addressing(uint32_t address, uint32_t trans_direction)
{
    /* configure slave address */
    I2C_CTL1 &= ~I2C_CTL1_SADDRESS;
    I2C_CTL1 |= (uint32_t)(address & I2C_CTL1_SADDRESS);
    /* configure transfer direction */
    I2C_CTL1 &= ~I2C_CTL1_TRDIR;
    I2C_CTL1 |= (uint32_t)(trans_direction & I2C_CTL1_TRDIR);
}

/*!
    \brief      10-bit address header executes read direction only in master receive mode (API_ID(0x0006U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_address10_header_enable(void)
{
    I2C_CTL1 |= I2C_CTL1_HEAD10R;
}

/*!
    \brief      10-bit address header executes complete sequence in master receive mode (API_ID(0x0007U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_address10_header_disable(void)
{
    I2C_CTL1 &= ~I2C_CTL1_HEAD10R;
}

/*!
    \brief      enable 10-bit addressing mode in master mode (API_ID(0x0008U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_address10_enable(void)
{
    I2C_CTL1 |= I2C_CTL1_ADD10EN;
}

/*!
    \brief      disable 10-bit addressing mode in master mode (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_address10_disable(void)
{
    I2C_CTL1 &= ~I2C_CTL1_ADD10EN;
}

/*!
    \brief      enable I2C automatic end mode in master mode (API_ID(0x000AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_automatic_end_enable(void)
{
    I2C_CTL1 |= I2C_CTL1_AUTOEND;
}

/*!
    \brief      disable I2C automatic end mode in master mode (API_ID(0x000BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_automatic_end_disable(void)
{
    I2C_CTL1 &= ~I2C_CTL1_AUTOEND;
}

/*!
    \brief      enable the response to a general call (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_slave_response_to_gcall_enable(void)
{
    I2C_CTL0 |= I2C_CTL0_GCEN;
}

/*!
    \brief      disable the response to a general call (API_ID(0x000DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_slave_response_to_gcall_disable(void)
{
    I2C_CTL0 &= ~I2C_CTL0_GCEN;
}

/*!
    \brief      enable to stretch SCL low when data is not ready in slave mode (API_ID(0x000EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_stretch_scl_low_enable(void)
{
    I2C_CTL0 &= ~I2C_CTL0_SS;
}

/*!
    \brief      disable to stretch SCL low when data is not ready in slave mode (API_ID(0x000FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_stretch_scl_low_disable(void)
{
    I2C_CTL0 |= I2C_CTL0_SS;
}

/*!
    \brief      configure I2C slave address (API_ID(0x0010U))
    \param[in]  address: I2C address
    \param[in]  addr_format: 7bits or 10bits
                only one parameter can be selected which is shown as below:
      \arg        I2C_ADDFORMAT_7BITS: 7bits
      \arg        I2C_ADDFORMAT_10BITS: 10bits
    \param[out] none
    \retval     none
*/
void i2c_address_config(uint32_t address, uint32_t addr_format)
{
    /* disable I2C address in slave mode */
    I2C_SADDR0 &= ~I2C_SADDR0_ADDRESSEN;
    /* configure ADDRESS bits and address format */
    address = address & I2C_ADDRESS_MASK;
    addr_format = addr_format & I2C_SADDR0_ADDFORMAT;
    I2C_SADDR0 = (addr_format | address);
    /* enable I2C address in slave mode */
    I2C_SADDR0 |= I2C_SADDR0_ADDRESSEN;
}

/*!
    \brief      define which bits of ADDRESS[7:1] need to compare with the incoming address byte (API_ID(0x0011U))
    \param[in]  compare_bits: the bits need to compare
                one or more parameters can be selected which are shown as below:
      \arg        ADDRESS_NO_COMPARE: all the ADDRESS[7:1] bits are masked
      \arg        ADDRESS_BIT1_COMPARE: address bit1 needs compare
      \arg        ADDRESS_BIT2_COMPARE: address bit2 needs compare
      \arg        ADDRESS_BIT3_COMPARE: address bit3 needs compare
      \arg        ADDRESS_BIT4_COMPARE: address bit4 needs compare
      \arg        ADDRESS_BIT5_COMPARE: address bit5 needs compare
      \arg        ADDRESS_BIT6_COMPARE: address bit6 needs compare
      \arg        ADDRESS_BIT7_COMPARE: address bit7 needs compare
      \arg        ADDRESS_ALL_COMPARE: no mask, all these bits must be compared
    \param[out] none
    \retval     none
*/
void i2c_address_bit_compare_config(uint32_t compare_bits)
{
    I2C_CTL2 &= ~I2C_CTL2_ADDM;
    I2C_CTL2 |= (uint32_t)(compare_bits << CTL2_ADDM_OFFSET) & I2C_CTL2_ADDM;
}

/*!
    \brief      disable I2C address in slave mode (API_ID(0x0012U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_address_disable(void)
{
    I2C_SADDR0 &= ~I2C_SADDR0_ADDRESSEN;
}

/*!
    \brief      configure I2C second slave address (API_ID(0x0013U))
    \param[in]  address: I2C address
    \param[in]  addr_mask: the bits not need to compare
                only one parameter can be selected which is shown as below:
      \arg        ADDRESS2_NO_MASK: no mask, all these bits must be compared
      \arg        ADDRESS2_MASK_BIT1: ADDRESS2[1] is masked, only ADDRESS2[7:2] are compared
      \arg        ADDRESS2_MASK_BIT1_2: ADDRESS2[2:1] is masked, only ADDRESS2[7:3] are compared
      \arg        ADDRESS2_MASK_BIT1_3: ADDRESS2[3:1] is masked, only ADDRESS2[7:4] are compared
      \arg        ADDRESS2_MASK_BIT1_4: ADDRESS2[4:1] is masked, only ADDRESS2[7:5] are compared
      \arg        ADDRESS2_MASK_BIT1_5: ADDRESS2[5:1] is masked, only ADDRESS2[7:6] are compared
      \arg        ADDRESS2_MASK_BIT1_6: ADDRESS2[6:1] is masked, only ADDRESS2[7] are compared
      \arg        ADDRESS2_MASK_ALL: all the ADDRESS2[7:1] bits are masked
    \param[out] none
    \retval     none
*/
void i2c_second_address_config(uint32_t address, uint32_t addr_mask)
{
    /* disable I2C second address in slave mode */
    I2C_SADDR1 &= ~I2C_SADDR1_ADDRESS2EN;
    /* configure ADDRESS2[7:1] */
    I2C_SADDR1 &= ~I2C_SADDR1_ADDRESS2;
    I2C_SADDR1 |= (uint32_t)(address & I2C_SADDR1_ADDRESS2);
    /* configure ADDRESS2[7:1] mask */
    I2C_SADDR1 &= ~I2C_SADDR1_ADDMSK2;
    I2C_SADDR1 |= (uint32_t)(addr_mask << SADDR1_ADDMSK_OFFSET) & I2C_SADDR1_ADDMSK2;
    /* enable I2C second address in slave mode */
    I2C_SADDR1 |= I2C_SADDR1_ADDRESS2EN;
}

/*!
    \brief      disable I2C second address in slave mode (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_second_address_disable(void)
{
    I2C_SADDR1 &= ~I2C_SADDR1_ADDRESS2EN;
}

/*!
    \brief      get received match address in slave mode (API_ID(0x0015U))
    \param[in]  none
    \param[out] none
    \retval     received match address
*/
uint32_t i2c_recevied_address_get(void)
{
    return (uint32_t)((I2C_STAT & I2C_STAT_READDR) >> STAT_READDR_OFFSET);
}

/*!
    \brief      enable slave byte control (API_ID(0x0016U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_slave_byte_control_enable(void)
{
    I2C_CTL0 |= I2C_CTL0_SBCTL;
}

/*!
    \brief      disable slave byte control (API_ID(0x0017U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_slave_byte_control_disable(void)
{
    I2C_CTL0 &= ~I2C_CTL0_SBCTL;
}

/*!
    \brief      generate a NACK in slave mode (API_ID(0x0018U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_nack_enable(void)
{
    I2C_CTL1 |= I2C_CTL1_NACKEN;
}

/*!
    \brief      enable wakeup from deep-sleep mode (API_ID(0x0019U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_wakeup_from_deepsleep_enable(void)
{
    I2C_CTL0 |= I2C_CTL0_WUEN;
}

/*!
    \brief      disable wakeup from deep-sleep mode (API_ID(0x001AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_wakeup_from_deepsleep_disable(void)
{
    I2C_CTL0 &= ~I2C_CTL0_WUEN;
}

/*!
    \brief      enable I2C (API_ID(0x001BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_enable(void)
{
    I2C_CTL0 |= I2C_CTL0_I2CEN;
}

/*!
    \brief      disable I2C (API_ID(0x001CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_disable(void)
{
    I2C_CTL0 &= ~I2C_CTL0_I2CEN;
}

/*!
    \brief      generate a START condition on I2C bus (API_ID(0x001DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_start_on_bus(void)
{
    I2C_CTL1 |= I2C_CTL1_START;
}

/*!
    \brief      generate a STOP condition on I2C bus (API_ID(0x001EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_stop_on_bus(void)
{
    I2C_CTL1 |= I2C_CTL1_STOP;
}

/*!
    \brief      I2C transmit data (API_ID(0x001FU))
    \param[in]  data: data to be transmitted
    \param[out] none
    \retval     none
*/
void i2c_data_transmit(uint8_t data)
{
    I2C_TDATA = (I2C_TDATA_TDATA & (uint32_t)data);
}

/*!
    \brief      I2C receive data (API_ID(0x0020U))
    \param[in]  none
    \param[out] none
    \retval     received data
*/
uint8_t i2c_data_receive(void)
{
    return (uint8_t)(I2C_RDATA & I2C_RDATA_RDATA);
}

/*!
    \brief      enable I2C reload mode (API_ID(0x0021U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_reload_enable(void)
{
    I2C_CTL1 |= I2C_CTL1_RELOAD;
}

/*!
    \brief      disable I2C reload mode (API_ID(0x0022U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_reload_disable(void)
{
    I2C_CTL1 &= ~I2C_CTL1_RELOAD;
}

/*!
    \brief      configure number of bytes to be transferred (API_ID(0x0023U))
    \param[in]  byte_number: 0x0-0xFF, number of bytes to be transferred
    \param[out] none
    \retval     none
*/
void i2c_transfer_byte_number_config(uint8_t byte_number)
{
    I2C_CTL1 &= ~I2C_CTL1_BYTENUM;
    I2C_CTL1 |= (uint32_t)((uint32_t)byte_number << CTL1_BYTENUM_OFFSET) & I2C_CTL1_BYTENUM;
}

/*!
    \brief      enable I2C DMA for transmission or reception (API_ID(0x0024U))
    \param[in]  dma: I2C DMA
                only one parameter can be selected which is shown as below:
      \arg        I2C_DMA_TRANSMIT: transmit data using DMA
      \arg        I2C_DMA_RECEIVE: receive data using DMA
    \param[out] none
    \retval     none
*/
void i2c_dma_enable(uint8_t dma)
{
    if(I2C_DMA_TRANSMIT == dma) {
        I2C_CTL0 |= I2C_CTL0_DENT;
    } else {
        I2C_CTL0 |= I2C_CTL0_DENR;
    }
}

/*!
    \brief      disable I2C DMA for transmission or reception (API_ID(0x0025U))
    \param[in]  dma: I2C DMA
                only one parameter can be selected which is shown as below:
      \arg        I2C_DMA_TRANSMIT: transmit data using DMA
      \arg        I2C_DMA_RECEIVE: receive data using DMA
    \param[out] none
    \retval     none
*/
void i2c_dma_disable(uint8_t dma)
{
    if(I2C_DMA_TRANSMIT == dma) {
        I2C_CTL0 &= ~I2C_CTL0_DENT;
    } else {
        I2C_CTL0 &= ~I2C_CTL0_DENR;
    }
}

/*!
    \brief      I2C transfers PEC value (API_ID(0x0026U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_pec_transfer(void)
{
    I2C_CTL1 |= I2C_CTL1_PECTRANS;
}

/*!
    \brief      enable I2C PEC calculation (API_ID(0x0027U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_pec_enable(void)
{
    I2C_CTL0 |= I2C_CTL0_PECEN;
}

/*!
    \brief      disable I2C PEC calculation (API_ID(0x0028U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_pec_disable(void)
{
    I2C_CTL0 &= ~I2C_CTL0_PECEN;
}

/*!
    \brief      get packet error checking value (API_ID(0x0029U))
    \param[in]  none
    \param[out] none
    \retval     PEC value
*/
uint32_t i2c_pec_value_get(void)
{
    return (I2C_PEC & I2C_PEC_PECV);
}

/*!
    \brief      enable SMBus mode (API_ID(0x002AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_smbus_mode_enable(void)
{
    I2C_CTL0 |= I2C_CTL0_SMBEN;
}

/*!
    \brief      disable SMBus mode (API_ID(0x002BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_smbus_mode_disable(void)
{
    I2C_CTL0 &= ~I2C_CTL0_SMBEN;
}

/*!
    \brief      enable SMBus alert (API_ID(0x002CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_smbus_alert_enable(void)
{
    I2C_CTL0 |= I2C_CTL0_SMBALTEN;
}

/*!
    \brief      disable SMBus alert (API_ID(0x002DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_smbus_alert_disable(void)
{
    I2C_CTL0 &= ~I2C_CTL0_SMBALTEN;
}

/*!
    \brief      enable SMBus device default address (API_ID(0x002EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_smbus_default_addr_enable(void)
{
    I2C_CTL0 |= I2C_CTL0_SMBDAEN;
}

/*!
    \brief      disable SMBus device default address (API_ID(0x002FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_smbus_default_addr_disable(void)
{
    I2C_CTL0 &= ~I2C_CTL0_SMBDAEN;
}

/*!
    \brief      enable SMBus host address (API_ID(0x0030U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_smbus_host_addr_enable(void)
{
    I2C_CTL0 |= I2C_CTL0_SMBHAEN;
}

/*!
    \brief      disable SMBus host address (API_ID(0x0031U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_smbus_host_addr_disable(void)
{
    I2C_CTL0 &= ~I2C_CTL0_SMBHAEN;
}

/*!
    \brief      enable extended clock timeout detection (API_ID(0x0032U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_extented_clock_timeout_enable(void)
{
    I2C_TIMEOUT |= I2C_TIMEOUT_EXTOEN;
}

/*!
    \brief      disable extended clock timeout detection (API_ID(0x0033U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_extented_clock_timeout_disable(void)
{
    I2C_TIMEOUT &= ~I2C_TIMEOUT_EXTOEN;
}

/*!
    \brief      enable clock timeout detection (API_ID(0x0034U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_clock_timeout_enable(void)
{
    I2C_TIMEOUT |= I2C_TIMEOUT_TOEN;
}

/*!
    \brief      disable clock timeout detection (API_ID(0x0035U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_clock_timeout_disable(void)
{
    I2C_TIMEOUT &= ~I2C_TIMEOUT_TOEN;
}

/*!
    \brief      configure bus timeout B (API_ID(0x0036U))
    \param[in]  timeout: bus timeout B(0-0xFFF)
    \param[out] none
    \retval     none
*/
void i2c_bus_timeout_b_config(uint32_t timeout)
{
    I2C_TIMEOUT &= ~I2C_TIMEOUT_BUSTOB;
    I2C_TIMEOUT |= (uint32_t)(timeout << TIMEOUT_BUSTOB_OFFSET) & I2C_TIMEOUT_BUSTOB;
}

/*!
    \brief      configure bus timeout A (API_ID(0x0037U))
    \param[in]  timeout: bus timeout A(0-0xFFF)
    \param[out] none
    \retval     none
*/
void i2c_bus_timeout_a_config(uint32_t timeout)
{
    I2C_TIMEOUT &= ~I2C_TIMEOUT_BUSTOA;
    I2C_TIMEOUT |= (uint32_t)(timeout & I2C_TIMEOUT_BUSTOA);
}

