burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_i2c.c
/*!
    \brief      configure idle clock timeout detection (API_ID(0x0038U))
    \param[in]  timeout: idle clock timeout detection content
                only one parameter can be selected which is shown as below:
      \arg        BUSTOA_DETECT_SCL_LOW: BUSTOA is used to detect SCL low timeout
      \arg        BUSTOA_DETECT_IDLE: BUSTOA is used to detect both SCL and SDA high timeout when the bus is idle
    \param[out] none
    \retval     none
*/
void i2c_idle_clock_timeout_config(uint32_t timeout)
{
    I2C_TIMEOUT &= ~I2C_TIMEOUT_TOIDLE;
    I2C_TIMEOUT |= (uint32_t)(timeout & I2C_TIMEOUT_TOIDLE);
}

/*!
    \brief      get I2C flag status (API_ID(0x0039U))
    \param[in]  flag: I2C flags
                only one parameter can be selected which is shown as below:
      \arg        I2C_FLAG_TBE: I2C_TDATA is empty during transmitting
      \arg        I2C_FLAG_TI: transmit interrupt
      \arg        I2C_FLAG_RBNE: I2C_RDATA is not empty during receiving
      \arg        I2C_FLAG_ADDSEND: address received matches in slave mode
      \arg        I2C_FLAG_NACK: not acknowledge flag
      \arg        I2C_FLAG_STPDET: STOP condition detected in slave mode
      \arg        I2C_FLAG_TC: transfer complete in master mode
      \arg        I2C_FLAG_TCR: transfer complete reload
      \arg        I2C_FLAG_BERR: bus error
      \arg        I2C_FLAG_LOSTARB: arbitration Lost
      \arg        I2C_FLAG_OUERR: overrun/underrun error in slave mode
      \arg        I2C_FLAG_PECERR: PEC error
      \arg        I2C_FLAG_TIMEOUT: timeout flag
      \arg        I2C_FLAG_SMBALT: SMBus alert
      \arg        I2C_FLAG_I2CBSY: busy flag
      \arg        I2C_FLAG_TR: whether the I2C is a transmitter or a receiver in slave mode
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus i2c_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;

    if(0U != (I2C_STAT & flag)) {
        reval = SET;
    } else {
        /* do nothing */
    }

    return reval;
}

/*!
    \brief      clear I2C flag status (API_ID(0x003AU))
    \param[in]  flag: I2C flags
                one or more parameters can be selected which are shown as below:
      \arg        I2C_FLAG_ADDSEND: address received matches in slave mode
      \arg        I2C_FLAG_NACK: not acknowledge flag
      \arg        I2C_FLAG_STPDET: STOP condition detected in slave mode
      \arg        I2C_FLAG_BERR: bus error
      \arg        I2C_FLAG_LOSTARB: arbitration Lost
      \arg        I2C_FLAG_OUERR: overrun/underrun error in slave mode
      \arg        I2C_FLAG_PECERR: PEC error
      \arg        I2C_FLAG_TIMEOUT: timeout flag
      \arg        I2C_FLAG_SMBALT: SMBus alert
    \param[out] none
    \retval     none
*/
void i2c_flag_clear(uint32_t flag)
{
    I2C_STATC |= flag;
}

/*!
    \brief      enable I2C interrupt (API_ID(0x003BU))
    \param[in]  interrupt: I2C interrupts
                one or more parameters can be selected which are shown as below:
      \arg        I2C_INT_ERR: error interrupt
      \arg        I2C_INT_TC: transfer complete interrupt
      \arg        I2C_INT_STPDET: stop detection interrupt
      \arg        I2C_INT_NACK: not acknowledge received interrupt
      \arg        I2C_INT_ADDM: address match interrupt
      \arg        I2C_INT_RBNE: receive interrupt
      \arg        I2C_INT_TI: transmit interrupt
    \param[out] none
    \retval     none
*/
void i2c_interrupt_enable(uint32_t interrupt)
{
    I2C_CTL0 |= (interrupt & I2C_INT_EN_MASK);
}

/*!
    \brief      disable I2C interrupt (API_ID(0x003CU))
    \param[in]  interrupt: I2C interrupts
                one or more parameters can be selected which are shown as below:
      \arg        I2C_INT_ERR: error interrupt
      \arg        I2C_INT_TC: transfer complete interrupt
      \arg        I2C_INT_STPDET: stop detection interrupt
      \arg        I2C_INT_NACK: not acknowledge received interrupt
      \arg        I2C_INT_ADDM: address match interrupt
      \arg        I2C_INT_RBNE: receive interrupt
      \arg        I2C_INT_TI: transmit interrupt
    \param[out] none
    \retval     none
*/
void i2c_interrupt_disable(uint32_t interrupt)
{
    I2C_CTL0 &= ~(interrupt & I2C_INT_EN_MASK);
}

/*!
    \brief      get I2C interrupt flag status (API_ID(0x003DU))
    \param[in]  int_flag: I2C interrupt flags, refer to i2c_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        I2C_INT_FLAG_TI: transmit interrupt flag
      \arg        I2C_INT_FLAG_RBNE: I2C_RDATA is not empty during receiving interrupt flag
      \arg        I2C_INT_FLAG_ADDSEND: address received matches in slave mode interrupt flag
      \arg        I2C_INT_FLAG_NACK: not acknowledge interrupt flag
      \arg        I2C_INT_FLAG_STPDET: stop condition detected in slave mode interrupt flag
      \arg        I2C_INT_FLAG_TC: transfer complete in master mode interrupt flag
      \arg        I2C_INT_FLAG_TCR: transfer complete reload interrupt flag
      \arg        I2C_INT_FLAG_BERR: bus error interrupt flag
      \arg        I2C_INT_FLAG_LOSTARB: arbitration lost interrupt flag
      \arg        I2C_INT_FLAG_OUERR: overrun/underrun error in slave mode interrupt flag
      \arg        I2C_INT_FLAG_PECERR: PEC error interrupt flag
      \arg        I2C_INT_FLAG_TIMEOUT: timeout interrupt flag
      \arg        I2C_INT_FLAG_SMBALT: SMBus alert interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus i2c_interrupt_flag_get(i2c_interrupt_flag_enum int_flag)
{
    uint32_t ret1, ret2;
    FlagStatus reval = RESET;

    /* get the status of interrupt enable bit */
    ret1 = (I2C_REG_VAL(int_flag) & BIT(I2C_BIT_POS(int_flag)));
    /* get the status of interrupt flag */
    ret2 = (I2C_REG_VAL2(int_flag) & BIT(I2C_BIT_POS2(int_flag)));
    if((0U != ret1) && (0U != ret2)) {
        reval = SET;
    } else {
        /* do nothing */
    }

    return reval;
}

/*!
    \brief      clear I2C interrupt flag status (API_ID(0x003EU))
    \param[in]  int_flag: I2C interrupt flags, refer to i2c_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        I2C_INT_FLAG_ADDSEND: address received matches in slave mode interrupt flag
      \arg        I2C_INT_FLAG_NACK: not acknowledge interrupt flag
      \arg        I2C_INT_FLAG_STPDET: stop condition detected in slave mode interrupt flag
      \arg        I2C_INT_FLAG_BERR: bus error interrupt flag
      \arg        I2C_INT_FLAG_LOSTARB: arbitration lost interrupt flag
      \arg        I2C_INT_FLAG_OUERR: overrun/underrun error in slave mode interrupt flag
      \arg        I2C_INT_FLAG_PECERR: PEC error interrupt flag
      \arg        I2C_INT_FLAG_TIMEOUT: timeout interrupt flag
      \arg        I2C_INT_FLAG_SMBALT: SMBus alert interrupt flag
    \param[out] none
    \retval     none
*/
void i2c_interrupt_flag_clear(i2c_interrupt_flag_enum int_flag)
{
    I2C_STATC |= BIT(I2C_BIT_POS2(int_flag));
}
